app/views/users/show.html.erb

			<%= link_to "Post an Update", root_path %>
			<% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 115