app/controllers/password_resets_controller.rb

  def create
  user = User.find_by_email(params[:email])
---
SELECT 1 FROM "users" WHERE (LOWER("users"."email") = LOWER('saagar@chronus.com') AND "users"."id" != 101) LIMIT 1

def edit
  @user = User.find_by_password_reset_token!(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = '31ab0ddb4bf8d2b84f169398a67527fdaec3c20c5cccbc13720f1a39ea6f8c6b' LIMIT 1

def update
  @user = User.find_by_password_reset_token!(params[:id])
  if @user.password_reset_sent_at < 2.hours.ago
    redirect_to new_password_reset_path, :alert => "Password reset has expired."
  elsif @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = '31ab0ddb4bf8d2b84f169398a67527fdaec3c20c5cccbc13720f1a39ea6f8c6b' LIMIT 1
UPDATE "users" SET "encrypted_password" = 'e39443347edf973ed8f643f8ba00e922b002c98a89a93ed3a3a20d392fae765c', "updated_at" = '2012-05-14 12:35:34.405245' WHERE "users"."id" = 101