app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 115
---
  def show
    @user= User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "password_reset_sent_at", "password_reset_token", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user=User.new(params[:user])
  	if @user.save